Revit 2024 API
FilteredElementCollector.IntersectWith Method
 Intersects the set of elements passing the filter in this collector with the set of elements passing the filter in another collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FilteredElementCollector IntersectWith(
	FilteredElementCollector other
)
Visual Basic
Public Function IntersectWith ( _
	other As FilteredElementCollector _
) As FilteredElementCollector
Visual C++
public:
FilteredElementCollector^ IntersectWith(
	FilteredElementCollector^ other
)
Parameters
other
Type: Autodesk.Revit.DB.FilteredElementCollector
 The other collector
Return Value
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Remarks
 The result will be the same as using a LogicalAndFilter to connect this filter with another. If you have an active iterator to this collector it will be stopped by this call.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter.
See Also
FilteredElementCollector Class
Autodesk.Revit.DB Namespace